# bash
brew 'bash'
brew 'bash-completion@2'

# git
brew 'git'
brew 'git-delta'
brew 'gh'

# Command line tools
brew 'bat'
brew 'bats'
brew 'direnv'
brew 'dockutil'
brew 'exa'
brew 'exercism'
brew 'fd'
brew 'fzf'
brew 'golangci/tap/golangci-lint'
brew 'graphviz'
brew 'heroku/brew/heroku'
brew 'httpie'
brew 'jq'
brew 'kubectl'
brew 'make'
brew 'ripgrep'
brew 'shellcheck'
brew 'tldr'
brew 'travis'
brew 'watch'

# Editors
cask 'goland'
brew 'nvim'
cask 'visual-studio-code'

# Language version managers
brew 'gimme'    # Go
brew 'nvm'      # Node.js
brew 'rbenv'    # Ruby

# Menu bar apps
cask 'docker'
cask 'dropbox'
cask 'flycut'
cask 'ivpn'
cask 'krisp'
cask 'rectangle'

# Apps
cask '1password'
cask 'brave-browser'
cask 'iterm2'
cask 'itsycal'
cask 'slack'
cask 'tableplus'
cask 'zoomus'
