# bash
brew 'bash'
brew 'bash-completion'
brew 'shellcheck'

# git
brew 'git'
brew 'diff-so-fancy'

# Command line tools
brew 'tree'
brew 'watch'
brew 'jq'
brew 'the_silver_searcher'
brew 'direnv'
brew 'make'
brew 'heroku/brew/heroku'

# Editors
cask 'atom'
cask 'goland'

# Ruby
brew 'rbenv'
brew 'rbenv-default-gems'

# Go
brew 'gimme'

# Node.js
brew 'nvm'

# Databases
brew 'postgresql'
brew 'mongodb/brew/mongodb-community'

# macOS tools
cask 'spectacle'
cask 'flycut'
brew 'dockutil'

# Apps
cask 'iterm2'
cask '1password'
cask 'google-chrome'
cask 'slack'
cask 'zoomus'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
