# bash
brew 'bash'
brew 'bash-completion@2'
brew 'shellcheck'

# git
brew 'git'
brew 'pivotal/tap/git-author'
brew 'diff-so-fancy'
brew 'gh'

# Command line tools
brew 'bat'
brew 'direnv'
brew 'dockutil'
brew 'exercism'
brew 'fzf'
brew 'heroku/brew/heroku'
brew 'httpie'
brew 'jq'
brew 'make'
brew 'nvim'
brew 'ripgrep'
brew 'telnet'
brew 'tldr'
brew 'travis'
brew 'tree'
brew 'watch'

# Editors
cask 'atom'
cask 'goland'
cask 'visual-studio-code'

# Ruby
brew 'rbenv'

# Go
brew 'gimme'

# Node.js
brew 'nvm'

# Databases
brew 'mongodb/brew/mongodb-community@4.2', restart_service: :changed
brew 'postgresql@12', restart_service: :changed

# macOS tools
cask 'flycut'
cask 'rectangle'

# Apps
cask '1password'
cask 'dropbox'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'tableplus'
cask 'zoomus'
