# bash
brew 'bash'
brew 'bash-completion'
brew 'shellcheck'

# git
brew 'git'
brew 'diff-so-fancy'
brew 'hub'

# Command line tools
brew 'direnv'
brew 'exercism'
brew 'heroku/brew/heroku'
brew 'httpie'
brew 'jq'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tree'
brew 'make'
brew 'watch'

# Editors
cask 'atom'
cask 'goland'

# Ruby
brew 'rbenv'
brew 'rbenv-default-gems'

# Go
brew 'gimme'

# Node.js
brew 'nvm'

# Databases
brew 'mongodb/brew/mongodb-community', restart_service: :changed
brew 'postgresql', restart_service: :changed

# macOS tools
brew 'dockutil'
cask 'flycut'
cask 'spectacle'

# Apps
cask '1password'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'tableplus'
cask 'zoomus'
